In [1]:
import pandas as pd
import numpy as np

import warnings 
warnings.filterwarnings('ignore')

In [2]:
data = pd.read_csv("jobs.csv", usecols = lambda x : x != "Unnamed: 0")

In [3]:
data.head()

,company_name,location,job_title,job_description,salary_estimate,other_details,rating
0,Procter & Gamble,Mumbai,Senior Manager – SAP Security Governance: Risk...,The Senior Manager’s role will ensure that the...,₹4L - ₹7L (Glassdoor Est.),Size\n10000+ Employees\nFounded\n1837\nType\nC...,4.1
1,S&P Global,Gurgaon,Apprentice – Data Analyst,We are responsible for assuring that data impa...,₹5L - ₹7L (Glassdoor Est.),Size\n10000+ Employees\nFounded\n1860\nType\nC...,4.1
2,Oracuz Infotech Pvt Ltd,Remote,Data Science Intern,You will be assigned with module projects and ...,₹5T (Employer Est.),NaN,NaN
3,Optum,Bengaluru,Manager Data Scientist,"As an Associate Manager, you will play a criti...",₹10L (Glassdoor Est.),NaN,NaN
4,ITI Data,Chennai,AWS Glue Data Engineer,Require Financial Services industry experience...,₹2L - ₹9L (Glassdoor Est.),Size\n201 to 500 Employees\nFounded\n1999\nTyp...,4.2

In [144]:
data.salary_estimate.str.split('(')[data.shape[0]-1][1]

'Glassdoor Est.)'

In [145]:
data.salary_estimate.str.split('(')[39][0]

'-1'

In [146]:
data.shape

(1193, 7)

In [147]:
data.duplicated().sum()/data.shape[0]

0.6865046102263203

In [148]:
(data[data['salary_estimate'] != '-1'].shape[0] - data[data['salary_estimate'] != '-1'].duplicated().sum())/data[data['salary_estimate'] != '-1'].shape[0]

0.20400943396226415

In [149]:
(data[data.salary_estimate == '-1'].shape[0] - data[data.salary_estimate == '-1'].duplicated().sum())/data[data.salary_estimate == '-1'].shape[0]

0.5826086956521739

In [4]:
data.drop_duplicates(inplace = True)

In [5]:
data.shape

(374, 7)

In [6]:
data.reset_index(drop = 'first', inplace = True)

In [153]:
# just checking what all does our salary estimate column have as unique values
for i in range(data.shape[0]):
    if(data.salary_estimate[i] != '-1'):
        print(i , data.salary_estimate.str.split('(')[i])
    else:
        continue

0 ['₹4L - ₹7L ', 'Glassdoor Est.)']
1 ['₹5L - ₹7L ', 'Glassdoor Est.)']
2 ['₹5T ', 'Employer Est.)']
3 ['₹10L ', 'Glassdoor Est.)']
4 ['₹2L - ₹9L ', 'Glassdoor Est.)']
5 ['₹12L - ₹16L ', 'Employer Est.)']
6 ['₹9L - ₹10L ', 'Glassdoor Est.)']
7 ['₹15T - ₹20T ', 'Employer Est.)']
8 ['₹10T - ₹16T ', 'Employer Est.)']
9 ['₹3L - ₹10L ', 'Glassdoor Est.)']
10 ['₹3L - ₹8L ', 'Glassdoor Est.)']
11 ['₹6L - ₹9L ', 'Glassdoor Est.)']
12 ['₹10T ', 'Employer Est.)']
13 ['₹4L - ₹10L ', 'Glassdoor Est.)']
14 ['₹10L ', 'Glassdoor Est.)']
15 ['₹2L - ₹10L ', 'Glassdoor Est.)']
16 ['₹3L - ₹9L ', 'Glassdoor Est.)']
17 ['₹5L - ₹9L ', 'Glassdoor Est.)']
18 ['₹5L - ₹10L ', 'Glassdoor Est.)']
19 ['₹5L ', 'Glassdoor Est.)']
20 ['₹85T - ₹9L ', 'Glassdoor Est.)']
21 ['₹5L - ₹9L ', 'Glassdoor Est.)']
22 ['₹4L - ₹9L ', 'Glassdoor Est.)']
23 ['₹25L - ₹40L ', 'Employer Est.)']
24 ['₹7L - ₹10L ', 'Glassdoor Est.)']
25 ['₹4L - ₹6L ', 'Glassdoor Est.)']
26 ['₹2L - ₹5L ', 'Glassdoor Est.)']
27 ['₹8T - ₹25T ', 'Employer Est.)']
28 ['₹10T - ₹18T ', 'Employer Est.)']
29 ['₹6L - ₹8L ', 'Glassdoor Est.)']
30 ['₹4L - ₹10L ', 'Glassdoor Est.)']
31 ['₹3L - ₹8L ', 'Glassdoor Est.)']
32 ['₹8L - ₹9L ', 'Glassdoor Est.)']
33 ['₹25L - ₹36L ', 'Employer Est.)']
34 ['₹5L - ₹17L ', 'Employer Est.)']
35 ['₹10T - ₹30T ', 'Employer Est.)']
36 ['₹5L - ₹9L ', 'Glassdoor Est.)']
37 ['₹3L - ₹6L ', 'Employer Est.)']
38 ['₹30T - ₹80T ', 'Employer Est.)']
60 ['₹10L ', 'Glassdoor Est.)']
61 ['₹4L - ₹10L ', 'Glassdoor Est.)']
62 ['₹9L - ₹10L ', 'Glassdoor Est.)']
63 ['₹60T - ₹4L ', 'Glassdoor Est.)']
64 ['₹9L - ₹10L ', 'Glassdoor Est.)']
65 ['₹6L - ₹9L ', 'Glassdoor Est.)']
66 ['₹4L - ₹7L ', 'Glassdoor Est.)']
67 ['₹7L - ₹8L ', 'Glassdoor Est.)']
68 ['₹9L - ₹10L ', 'Glassdoor Est.)']
69 ['₹1L - ₹8L ', 'Glassdoor Est.)']
70 ['₹10L ', 'Glassdoor Est.)']
71 ['₹6L - ₹9L ', 'Glassdoor Est.)']
72 ['₹6L - ₹7L ', 'Glassdoor Est.)']
73 ['₹7L - ₹9L ', 'Glassdoor Est.)']
74 ['₹6L - ₹10L ', 'Glassdoor Est.)']
75 ['₹6L - ₹7L ', 'Glassdoor Est.)']
76 ['₹2L - ₹6L ', 'Glassdoor Est.)']
77 ['₹6L - ₹9L ', 'Glassdoor Est.)']
78 ['₹6L - ₹8L ', 'Glassdoor Est.)']
79 ['₹4L - ₹8L ', 'Glassdoor Est.)']
110 ['₹8L - ₹10L ', 'Glassdoor Est.)']
111 ['₹6L - ₹7L ', 'Glassdoor Est.)']
112 ['₹85T - ₹9L ', 'Glassdoor Est.)']
113 ['₹9L - ₹10L ', 'Glassdoor Est.)']
114 ['₹4L - ₹6L ', 'Employer Est.)']
115 ['₹10T - ₹30T ', 'Employer Est.)']
116 ['₹5L - ₹9L ', 'Glassdoor Est.)']
117 ['₹12T - ₹20T ', 'Employer Est.)']
118 ['₹8L ', 'Glassdoor Est.)']
119 ['₹7L - ₹9L ', 'Glassdoor Est.)']
120 ['₹4L ', 'Employer Est.)']
121 ['₹20T ', 'Employer Est.)']
122 ['₹7L - ₹9L ', 'Glassdoor Est.)']
123 ['₹7L - ₹8L ', 'Glassdoor Est.)']
124 ['₹96T - ₹2L ', 'Glassdoor Est.)']
125 ['₹3L - ₹5L ', 'Glassdoor Est.)']
126 ['₹4L - ₹9L ', 'Glassdoor Est.)']
127 ['₹4T - ₹5T ', 'Employer Est.)']
128 ['₹7L - ₹8L ', 'Glassdoor Est.)']
159 ['₹3L - ₹8L ', 'Glassdoor Est.)']
160 ['₹2L - ₹9L ', 'Glassdoor Est.)']
161 ['₹10L ', 'Glassdoor Est.)']
162 ['₹5L - ₹10L ', 'Glassdoor Est.)']
163 ['₹5L - ₹10L ', 'Glassdoor Est.)']
164 ['₹4L - ₹9L ', 'Glassdoor Est.)']
165 ['₹5L - ₹7L ', 'Glassdoor Est.)']
166 ['₹6L - ₹9L ', 'Glassdoor Est.)']
167 ['₹4L - ₹7L ', 'Glassdoor Est.)']
168 ['₹5L - ₹9L ', 'Glassdoor Est.)']
169 ['₹10L ', 'Glassdoor Est.)']
170 ['₹3L - ₹6L ', 'Glassdoor Est.)']
171 ['₹3L - ₹6L ', 'Glassdoor Est.)']
172 ['₹5L - ₹10L ', 'Glassdoor Est.)']
173 ['₹3L - ₹8L ', 'Glassdoor Est.)']
174 ['₹5L - ₹8L ', 'Glassdoor Est.)']
175 ['₹6L - ₹7L ', 'Glassdoor Est.)']
176 ['₹6L - ₹7L ', 'Glassdoor Est.)']
177 ['₹3L - ₹6L ', 'Glassdoor Est.)']
178 ['₹5L - ₹7L ', 'Glassdoor Est.)']
179 ['₹3L - ₹7L ', 'Glassdoor Est.)']
180 ['₹3L - ₹7L ', 'Glassdoor Est.)']
211 ['₹6L - ₹7L ', 'Glassdoor Est.)']
212 ['₹5L - ₹10L ', 'Glassdoor Est.)']
213 ['₹85T - ₹9L ', 'Glassdoor Est.)']
214 ['₹5L - ₹9L ', 'Glassdoor Est.)']
215 ['₹5L - ₹9L ', 'Glassdoor Est.)']
216 ['₹4L - ₹9L ', 'Glassdoor Est.)']
217 ['₹36T - ₹64T ', 'Glassdoor Est.)']
218 ['₹6L - ₹7L ', 'Glassdoor Est.)']
219 ['₹5L - ₹9L ', 'Glassdoor Est.)']
220 ['₹10L - ₹15L ', 'Employer Est.)']
221 ['₹6L - ₹20L ', 'Employer Est.)']
222 ['₹3L - ₹4L ', 'Glassdoor Est.)']
223 ['₹3L - ₹6L ', 'Glassdoor Est.)']
224 ['₹2L - ₹10L ', 'Glassdoor Est.)']
225 ['₹2L - ₹4L ', 'Glassdoor Est.)']
226 ['₹10L ', 'Glassdoor Est.)']
227 ['₹5L - ₹10L ', 'Glassdoor Est.)']
228 ['₹6L - ₹9L ', 'Glassdoor Est.)']
229 ['₹50T - ₹1L ', 'Employer Est.)']
230 ['₹10L ', 'Glassdoor Est.)']
231 ['₹4L - ₹8L ', 'Glassdoor Est.)']
232 ['₹3L - ₹5L ', 'Glassdoor Est.)']
233 ['₹9L - ₹10L ', 'Glassdoor Est.)']
234 ['₹10T - ₹45T ', 'Employer Est.)']
235 ['₹4L ', 'Employer Est.)']
236 ['₹4L - ₹7L ', 'Glassdoor Est.)']
237 ['₹5L - ₹9L ', 'Glassdoor Est.)']
269 ['₹3L - ₹8L ', 'Glassdoor Est.)']
270 ['₹2L - ₹9L ', 'Glassdoor Est.)']
271 ['₹4L - ₹9L ', 'Glassdoor Est.)']
272 ['₹5L - ₹10L ', 'Glassdoor Est.)']
273 ['₹7L - ₹10L ', 'Glassdoor Est.)']
274 ['₹5L - ₹9L ', 'Glassdoor Est.)']
275 ['₹3L - ₹6L ', 'Glassdoor Est.)']
276 ['₹4L - ₹8L ', 'Glassdoor Est.)']
277 ['₹4L - ₹7L ', 'Glassdoor Est.)']
278 ['₹4L ', 'Glassdoor Est.)']
279 ['₹5L - ₹10L ', 'Glassdoor Est.)']
280 ['₹8L - ₹10L ', 'Employer Est.)']
281 ['₹3L - ₹8L ', 'Glassdoor Est.)']
282 ['₹7L - ₹9L ', 'Glassdoor Est.)']
283 ['₹7L - ₹10L ', 'Glassdoor Est.)']
284 ['₹3L - ₹6L ', 'Glassdoor Est.)']
285 ['₹7L - ₹10L ', 'Glassdoor Est.)']
286 ['₹3L - ₹8L ', 'Glassdoor Est.)']
287 ['₹4L - ₹6L ', 'Glassdoor Est.)']
288 ['₹6L - ₹7L ', 'Glassdoor Est.)']
289 ['₹5L - ₹10L ', 'Glassdoor Est.)']
290 ['₹2L - ₹5L ', 'Glassdoor Est.)']
291 ['₹6L - ₹9L ', 'Glassdoor Est.)']
323 ['₹85T - ₹9L ', 'Glassdoor Est.)']
324 ['₹4L - ₹9L ', 'Glassdoor Est.)']
325 ['₹6L - ₹8L ', 'Glassdoor Est.)']
326 ['₹2L - ₹10L ', 'Glassdoor Est.)']
327 ['₹80T - ₹1L ', 'Glassdoor Est.)']
328 ['₹9L - ₹10L ', 'Glassdoor Est.)']
329 ['₹7L - ₹9L ', 'Glassdoor Est.)']
330 ['₹4L - ₹7L ', 'Glassdoor Est.)']
331 ['₹2L - ₹5L ', 'Glassdoor Est.)']
332 ['₹5L - ₹8L ', 'Glassdoor Est.)']
333 ['₹3L - ₹6L ', 'Glassdoor Est.)']
334 ['₹4L ', 'Glassdoor Est.)']
335 ['₹4L - ₹7L ', 'Glassdoor Est.)']
336 ['₹3L - ₹8L ', 'Glassdoor Est.)']
337 ['₹5L - ₹8L ', 'Glassdoor Est.)']
338 ['₹2L - ₹8L ', 'Glassdoor Est.)']
339 ['₹4L - ₹7L ', 'Glassdoor Est.)']
340 ['₹8L ', 'Glassdoor Est.)']
341 ['₹4L - ₹9L ', 'Glassdoor Est.)']
342 ['₹4L - ₹8L ', 'Glassdoor Est.)']
343 ['₹3L - ₹7L ', 'Glassdoor Est.)']
344 ['₹10T ', 'Employer Est.)']
345 ['₹5L - ₹8L ', 'Employer Est.)']

### Checking for null values

In [154]:
data.isnull().sum()

company_name        0
location            0
job_title           0
job_description     0
salary_estimate     0
other_details      51
rating             53
dtype: int64

### To know about the data type of each of our columns

In [155]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 374 entries, 0 to 373
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   company_name     374 non-null    object
 1   location         374 non-null    object
 2   job_title        374 non-null    object
 3   job_description  374 non-null    object
 4   salary_estimate  374 non-null    object
 5   other_details    323 non-null    object
 6   rating           321 non-null    float64
dtypes: float64(1), object(6)
memory usage: 20.6+ KB

### To see how many rows have -1 as salary meaning that the salary data was not present for these rows while scraping.

In [7]:
data.salary_estimate.value_counts()

-1                             201
₹5L - ₹9L (Glassdoor Est.)      10
₹5L - ₹10L (Glassdoor Est.)      9
₹4L - ₹7L (Glassdoor Est.)       8
₹10L (Glassdoor Est.)            8
                              ...
₹60T - ₹4L (Glassdoor Est.)      1
₹1L - ₹8L (Glassdoor Est.)       1
₹6L - ₹10L (Glassdoor Est.)      1
₹2L - ₹6L (Glassdoor Est.)       1
₹5L - ₹8L (Employer Est.)        1
Name: salary_estimate, Length: 67, dtype: int64

### Things that we decided to do , after looking at the data 

* correct the salary estimate column 

 -- for 2 things - make it to avg salary as a numeric column and remove the -1 valued rows if feasible
 
 -- make a separate column indicating employer provided estimate 
 
* split the other details column to the required different categories

### Correcting the salary column

### We can see that some salary values are in thousands while others in lakh
We need to bring them to common scale to take their average later, one way of doing this could be to add 0's accordingly 

T = 1000
L = 100000

So our analysis can go this way that we take the min salary and place 0's in it then separately extract the max salary and place 0's in it.

#### We can use the rows with -1 as salary as our test dataset !
So let's keep this in our analysis and not drop it out since later we can do train test split

In [157]:
data.shape

(374, 7)

In [158]:
'Glassdoor Est.' in data['salary_estimate'].str.split('(')[0][1]

True

In [159]:
data['salary_estimate'].str.split('(')[0]

['₹4L - ₹7L ', 'Glassdoor Est.)']

In [8]:
for i in range(data.shape[0]):
    if 'Employer Est.' in data['salary_estimate'].str.split('('):
        print(i)

In [9]:
data['employer_estimate'] = data['salary_estimate'].apply(lambda x : 1 if '(' in x and 'employer est' in x.split('(')[-1].lower() else 0)

In [10]:
# taking the employer est indicator column out
data['salary_estimate'].apply(lambda x : 1 if '(' in x and 'Employer Est.' in x.split('(')[-1] else 0).value_counts()

0    347
1     27
Name: salary_estimate, dtype: int64

`now separating min value and max value of salary in separate columns`

In [163]:
for i in range(data.shape[0]):
    if data['salary_estimate'].str.split('-')[i][0] != '' :
        print(data['salary_estimate'].str.split('-')[i][0]) # we do .str.split() since series object has no attribute as split

₹4L
₹5L
₹5T (Employer Est.)
₹10L (Glassdoor Est.)
₹2L
₹12L
₹9L
₹15T
₹10T
₹3L
₹3L
₹6L
₹10T (Employer Est.)
₹4L
₹10L (Glassdoor Est.)
₹2L
₹3L
₹5L
₹5L
₹5L (Glassdoor Est.)
₹85T
₹5L
₹4L
₹25L
₹7L
₹4L
₹2L
₹8T
₹10T
₹6L
₹4L
₹3L
₹8L
₹25L
₹5L
₹10T
₹5L
₹3L
₹30T
₹10L (Glassdoor Est.)
₹4L
₹9L
₹60T
₹9L
₹6L
₹4L
₹7L
₹9L
₹1L
₹10L (Glassdoor Est.)
₹6L
₹6L
₹7L
₹6L
₹6L
₹2L
₹6L
₹6L
₹4L
₹8L
₹6L
₹85T
₹9L
₹4L
₹10T
₹5L
₹12T
₹8L (Glassdoor Est.)
₹7L
₹4L (Employer Est.)
₹20T (Employer Est.)
₹7L
₹7L
₹96T
₹3L
₹4L
₹4T
₹7L
₹3L
₹2L
₹10L (Glassdoor Est.)
₹5L
₹5L
₹4L
₹5L
₹6L
₹4L
₹5L
₹10L (Glassdoor Est.)
₹3L
₹3L
₹5L
₹3L
₹5L
₹6L
₹6L
₹3L
₹5L
₹3L
₹3L
₹6L
₹5L
₹85T
₹5L
₹5L
₹4L
₹36T
₹6L
₹5L
₹10L
₹6L
₹3L
₹3L
₹2L
₹2L
₹10L (Glassdoor Est.)
₹5L
₹6L
₹50T
₹10L (Glassdoor Est.)
₹4L
₹3L
₹9L
₹10T
₹4L (Employer Est.)
₹4L
₹5L
₹3L
₹2L
₹4L
₹5L
₹7L
₹5L
₹3L
₹4L
₹4L
₹4L (Glassdoor Est.)
₹5L
₹8L
₹3L
₹7L
₹7L
₹3L
₹7L
₹3L
₹4L
₹6L
₹5L
₹2L
₹6L
₹85T
₹4L
₹6L
₹2L
₹80T
₹9L
₹7L
₹4L
₹2L
₹5L
₹3L
₹4L (Glassdoor Est.)
₹4L
₹3L
₹5L
₹2L
₹4L
₹8L (Glassdoor Est.)
₹4L
₹4L
₹3L
₹10T (Employer Est.)
₹5L

In [164]:
data['salary_estimate'].str.split('-')

0      [₹4L ,  ₹7L (Glassdoor Est.)]
1      [₹5L ,  ₹7L (Glassdoor Est.)]
2              [₹5T (Employer Est.)]
3            [₹10L (Glassdoor Est.)]
4      [₹2L ,  ₹9L (Glassdoor Est.)]
                   ...
369                            [, 1]
370                            [, 1]
371                            [, 1]
372                            [, 1]
373                            [, 1]
Name: salary_estimate, Length: 374, dtype: object

In [11]:
data['min_salary'] = data['salary_estimate'].apply(lambda x : x.split('-')[0] if '-1' not in x else '-1')

In [12]:
data['max_salary'] = data['salary_estimate'].apply(lambda x : x.split('-')[-1] if '-1' not in x else '-1')

In [13]:
# Now dropping out the Rs symbol and employer est or glassdoor est from the min max salaries
# replace(r'\(.*?\)','', regex = True) this replaces the anything written in salary column within the brackets
data['max_salary'] = data['max_salary'].apply(lambda x : x.replace('₹','') if '-1' not in x else '-1').replace(r'\(.*?\)','', regex = True)

In [14]:
data['min_salary'] = data['min_salary'].apply(lambda x : x.replace('₹','') if '-1' not in x else '-1').replace(r'\(.*?\)','', regex = True)

In [15]:
data.head()

,company_name,location,job_title,job_description,salary_estimate,other_details,rating,employer_estimate,min_salary,max_salary
0,Procter & Gamble,Mumbai,Senior Manager – SAP Security Governance: Risk...,The Senior Manager’s role will ensure that the...,₹4L - ₹7L (Glassdoor Est.),Size\n10000+ Employees\nFounded\n1837\nType\nC...,4.1,0,4L,7L
1,S&P Global,Gurgaon,Apprentice – Data Analyst,We are responsible for assuring that data impa...,₹5L - ₹7L (Glassdoor Est.),Size\n10000+ Employees\nFounded\n1860\nType\nC...,4.1,0,5L,7L
2,Oracuz Infotech Pvt Ltd,Remote,Data Science Intern,You will be assigned with module projects and ...,₹5T (Employer Est.),NaN,NaN,1,5T,5T
3,Optum,Bengaluru,Manager Data Scientist,"As an Associate Manager, you will play a criti...",₹10L (Glassdoor Est.),NaN,NaN,0,10L,10L
4,ITI Data,Chennai,AWS Glue Data Engineer,Require Financial Services industry experience...,₹2L - ₹9L (Glassdoor Est.),Size\n201 to 500 Employees\nFounded\n1999\nTyp...,4.2,0,2L,9L

`Now next step is to create avg salary column after miltiplying 1000 inplace of T and 100,000 in place of L and then averaging both the column value`

In [170]:
'L' in data['max_salary'][0]

True

In [16]:
for i in range(data.shape[0]):
    if 'L' in data['max_salary'][i]:
        data['max_salary'][i] = data['max_salary'][i].replace('L','*100000')
    elif 'T' in data['max_salary'][i]:
        data['max_salary'][i] = data['max_salary'][i].replace('T','*1000')

In [17]:
data['max_salary']

0       7*100000
1       7*100000
2         5*1000
3      10*100000
4       9*100000
          ...
369            -1
370            -1
371            -1
372            -1
373            -1
Name: max_salary, Length: 374, dtype: object

In [18]:
data['max_salary'] = data['max_salary'].apply(eval)

In [19]:
for i in range(data.shape[0]):
    if 'L' in data['min_salary'][i]:
        data['min_salary'][i] = data['min_salary'][i].replace('L','*100000')
    elif 'T' in data['min_salary'][i]:
        data['min_salary'][i] = data['min_salary'][i].replace('T','*1000')

In [20]:
data['min_salary'] = data['min_salary'].apply(eval)

In [21]:
data['min_salary']

0       400000
1       500000
2         5000
3      1000000
4       200000
        ...
369         -1
370         -1
371         -1
372         -1
373         -1
Name: min_salary, Length: 374, dtype: int64

In [22]:
# calculating avg salary
data['avg_salary'] = (data['max_salary'] + data['min_salary'])/2

In [23]:
data['avg_salary']

0       550000.0
1       600000.0
2         5000.0
3      1000000.0
4       550000.0
         ...
369         -1.0
370         -1.0
371         -1.0
372         -1.0
373         -1.0
Name: avg_salary, Length: 374, dtype: float64

In [24]:
data.avg_salary.value_counts()

-1.0          201
 650000.0      20
 550000.0      19
 750000.0      19
 700000.0      16
 600000.0      11
 450000.0       9
 500000.0       8
 800000.0       8
 1000000.0      8
 950000.0       7
 400000.0       7
 850000.0       5
 492500.0       4
 350000.0       4
 20000.0        3
 900000.0       2
 10000.0        2
 27500.0        1
 16000.0        1
 1300000.0      1
 148000.0       1
 75000.0        1
 50000.0        1
 1250000.0      1
 300000.0       1
 4500.0         1
 3050000.0      1
 230000.0       1
 55000.0        1
 1100000.0      1
 14000.0        1
 16500.0        1
 3250000.0      1
 13000.0        1
 17500.0        1
 1400000.0      1
 5000.0         1
 90000.0        1
Name: avg_salary, dtype: int64

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 374 entries, 0 to 373
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   company_name       374 non-null    object
 1   location           374 non-null    object
 2   job_title          374 non-null    object
 3   job_description    374 non-null    object
 4   salary_estimate    374 non-null    object
 5   other_details      323 non-null    object
 6   rating             321 non-null    float64
 7   employer_estimate  374 non-null    int64
 8   min_salary         374 non-null    int64
 9   max_salary         374 non-null    int64
 10  avg_salary         374 non-null    float64
dtypes: float64(2), int64(3), object(6)
memory usage: 32.3+ KB

`A bit of trial code for salary column`

In [181]:
# This type of treatment for salary column couldn't work since we had salary in different units i.e. thoudands and lakhs 
def extract_nums(string):
    #lst = []
    i = 0
    temp = ""
    while i < len(string):
        try :
            int(string[i])
            temp += string[i]
        except:
            if(string[i] == '-'):
                temp += string[i]
        i+=1
    return temp

In [182]:
# trial on smaller piece of code
#extract_nums(data['salary_estimate'][1191])

#### Now let's create an avg salary column

In [183]:
# for i in range(df.shape[0]):
#     gotin = 0
#     for j in range(len(df['avg_salary'][i])-1):
#         gotin = 1
#         df['avg_salary'][i] = int(df['avg_salary'][i][j]) + int(df['avg_salary'][i][j+1])/2
#     if(gotin == 0):
#         df['avg_salary'][i] = int(df['avg_salary'][i][0])

## Extracting other columns from other_details  column

In [26]:
data['other_details'].str.split('\n')[0]

['Size',
 '10000+ Employees',
 'Founded',
 '1837',
 'Type',
 'Company - Public',
 'Industry',
 'Consumer Product Manufacturing',
 'Sector',
 'Manufacturing',
 'Revenue',
 '$10+ billion (USD)']

In [185]:
# there are nan values also present ...
# nan is of type float
for col in data['other_details']:
    #print(type(col)) # this line tells us this fact about nan
    pass

In [186]:
type(data['other_details'][2])

float

In [187]:
# A trial code to understand the flow...
#for col in df['other_details']:
try:
    if(np.isnan(data['other_details'][0])):
        pass
except:
    lst = data['other_details'][0].split('\n')
    for i in range(0,len(lst)-1,2):
        #print(lst[i+1])
        print(lst[i])
        print(lst[i+1])

Size
10000+ Employees
Founded
1837
Type
Company - Public
Industry
Consumer Product Manufacturing
Sector
Manufacturing
Revenue
$10+ billion (USD)

In [27]:
# we noticed that 
# 1st row is column heading - next row is the value 
# below function would extract them all

def form_other_columns(column):
    for index,col in enumerate(column):
        # if(col == np.nan): can't be used since np.nan != to itself i.e. np.nan
        # putting below thing in try block since isnan gives error on non-numeric type
        try:
            if(np.isnan(col)):
                continue
        except:
            lst = col.split('\n')
            for i in range(0,len(lst)-1,2):
                #print(i)
                if(index == 0):
                    data[lst[i]] = lst[i+1] # at this time when index==0 , its the first time so the column with heading lst[i] does not exist at this moment so we can't index it further writing [index]
                else:
                    data[lst[i]][index] = lst[i+1] # indexing it with [index] is necessary to ensure filling the values in respective rows otherwise we'll end up filling the same entry in every cell 
        
form_other_columns(data['other_details'])
#df.apply(form_other_columns)

In [28]:
data.head()

,company_name,location,job_title,job_description,salary_estimate,other_details,rating,employer_estimate,min_salary,max_salary,avg_salary,Size,Founded,Type,Industry,Sector,Revenue
0,Procter & Gamble,Mumbai,Senior Manager – SAP Security Governance: Risk...,The Senior Manager’s role will ensure that the...,₹4L - ₹7L (Glassdoor Est.),Size\n10000+ Employees\nFounded\n1837\nType\nC...,4.1,0,400000,700000,550000.0,10000+ Employees,1837,Company - Public,Consumer Product Manufacturing,Manufacturing,$10+ billion (USD)
1,S&P Global,Gurgaon,Apprentice – Data Analyst,We are responsible for assuring that data impa...,₹5L - ₹7L (Glassdoor Est.),Size\n10000+ Employees\nFounded\n1860\nType\nC...,4.1,0,500000,700000,600000.0,10000+ Employees,1860,Company - Public,Research and development,Management and consulting,$10+ billion (USD)
2,Oracuz Infotech Pvt Ltd,Remote,Data Science Intern,You will be assigned with module projects and ...,₹5T (Employer Est.),NaN,NaN,1,5000,5000,5000.0,10000+ Employees,1837,Company - Public,Consumer Product Manufacturing,Manufacturing,$10+ billion (USD)
3,Optum,Bengaluru,Manager Data Scientist,"As an Associate Manager, you will play a criti...",₹10L (Glassdoor Est.),NaN,NaN,0,1000000,1000000,1000000.0,10000+ Employees,1837,Company - Public,Consumer Product Manufacturing,Manufacturing,$10+ billion (USD)
4,ITI Data,Chennai,AWS Glue Data Engineer,Require Financial Services industry experience...,₹2L - ₹9L (Glassdoor Est.),Size\n201 to 500 Employees\nFounded\n1999\nTyp...,4.2,0,200000,900000,550000.0,201 to 500 Employees,1999,Company - Private,Information Technology Support Services,Information Technology,Unknown / Non-Applicable

In [190]:
# performs the same task as the above function but avoids the use of try-except block

# def form_other_columns2(column):
#     for index,col in enumerate(column):
#         # if(col == np.nan): can't be used since np.nan != to itself i.e. np.nan
#         # putting below thing in try block since isnan gives error on non-numeric type
    
#         if(np.isinstance(col,float) and np.isnan(col)):
#                 continue
        
#         lst = col.split('\n')
#         for i in range(0,len(lst)-1,2):
#             #print(i)
#             if(index == 0):
#                 df[lst[i]] = lst[i+1]
#             else:
#                 df[lst[i]][index] = lst[i+1]
        
# form_other_columns(df['other_details'])

#df.apply(form_other_columns)

In [29]:
# correcting the values of the new columns where the corresponding other_details value was nan
data.loc[data['other_details'].isna(),['Size','Founded','Type','Industry','Sector','Revenue']] = np.nan

In [192]:
# confirming that those column values successfully converted to nan
#data.loc[data['other_details'].isna(),['Size','Founded','Type','Industry','Sector','Revenue']]

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 374 entries, 0 to 373
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   company_name       374 non-null    object
 1   location           374 non-null    object
 2   job_title          374 non-null    object
 3   job_description    374 non-null    object
 4   salary_estimate    374 non-null    object
 5   other_details      323 non-null    object
 6   rating             321 non-null    float64
 7   employer_estimate  374 non-null    int64
 8   min_salary         374 non-null    int64
 9   max_salary         374 non-null    int64
 10  avg_salary         374 non-null    float64
 11  Size               323 non-null    object
 12  Founded            323 non-null    object
 13  Type               323 non-null    object
 14  Industry           323 non-null    object
 15  Sector             323 non-null    object
 16  Revenue            323 non-null    object
dtypes: float64(2), int64(3), object(12)
memory usage: 49.8+ KB

In [31]:
# now we can simply drop the salary_estimate and other_details columns
data.drop(['salary_estimate','other_details'],inplace=True,axis=1)

In [32]:
data.job_title.value_counts()

Data Science Intern                                                   14
Data Analyst                                                          14
Data Scientist                                                        12
Data Engineer                                                          6
Data Analyst, Predictive, India- X Delivery                            6
                                                                      ..
Senior Knowledge Analyst - Healthcare Ops                              1
Software Development Engineer II                                       1
Applications Developer (Independent Contractor)—Bhubaneswar, India     1
Engineer III - Software Engineering (IN)                               1
2025 Bangalore Software Engineering Internship                         1
Name: job_title, Length: 186, dtype: int64

## Separating the skills column from description of jobs

In [196]:
len(data['job_description']) == data.shape[0]

True

In [197]:
data['job_description'].str.split('\n')[370]#[1]

['Join our team as an experienced data scientist with a passion for tackling complex challenges in clean tech and climate science. If you’re also enthusiastic……']

In [198]:
data.shape

(374, 15)

In [33]:
data['skills'] = np.nan
for i in range(data.shape[0]):
    l = data['job_description'].str.split('\n')
    if(len(l[i]) > 1):
        #print(i, l[i][1]) # for debugging purposes
        # it gives list index out of range for the cells where skills are not mentioned explicitly
        data['skills'][i] = l[i][1]

In [34]:
data.head()

,company_name,location,job_title,job_description,rating,employer_estimate,min_salary,max_salary,avg_salary,Size,Founded,Type,Industry,Sector,Revenue,skills
0,Procter & Gamble,Mumbai,Senior Manager – SAP Security Governance: Risk...,The Senior Manager’s role will ensure that the...,4.1,0,400000,700000,550000.0,10000+ Employees,1837,Company - Public,Consumer Product Manufacturing,Manufacturing,$10+ billion (USD),"Skills: SAP, SOX, Analysis skills, SAP S/4HANA..."
1,S&P Global,Gurgaon,Apprentice – Data Analyst,We are responsible for assuring that data impa...,4.1,0,500000,700000,600000.0,10000+ Employees,1860,Company - Public,Research and development,Management and consulting,$10+ billion (USD),"Skills: Business intelligence, Relational data..."
2,Oracuz Infotech Pvt Ltd,Remote,Data Science Intern,You will be assigned with module projects and ...,NaN,1,5000,5000,5000.0,NaN,NaN,NaN,NaN,NaN,NaN,"Skills: Web development, Machine learning, Dat..."
3,Optum,Bengaluru,Manager Data Scientist,"As an Associate Manager, you will play a criti...",NaN,0,1000000,1000000,1000000.0,NaN,NaN,NaN,NaN,NaN,NaN,"Skills: TensorFlow, Big data, SQL, Analysis sk..."
4,ITI Data,Chennai,AWS Glue Data Engineer,Require Financial Services industry experience...,4.2,0,200000,900000,550000.0,201 to 500 Employees,1999,Company - Private,Information Technology Support Services,Information Technology,Unknown / Non-Applicable,"Skills: Oracle, XML, Spark, NoSQL, MongoDB"

In [201]:
data.skills[0].split(':')

['Skills', ' SAP, SOX, Analysis skills, SAP S/4HANA, RMF']

In [35]:
for i in range(data.shape[0]):
    # isinstance ensures that we only check isnan when current obj is of float type this helps prevent error when isnan is called on string type
    if(isinstance(data['skills'][i],float) and np.isnan(data['skills'][i])):
        continue
    #print(data['skills'].str.split(':')[i]) # debugging
    data['skills'][i] = data['skills'].str.split(':')[i][1]

In [36]:
data.skills

0            SAP, SOX, Analysis skills, SAP S/4HANA, RMF
1       Business intelligence, Relational databases, ...
2        Web development, Machine learning, Data science
3       TensorFlow, Big data, SQL, Analysis skills, M...
4                     Oracle, XML, Spark, NoSQL, MongoDB
                             ...
369                Machine learning, Distributed systems
370                                                  NaN
371     Image processing, Machine learning, Natural l...
372                                         Data science
373     Power BI, Microsoft Excel, Salesforce, Applic...
Name: skills, Length: 374, dtype: object

`i think that bag of words can be used for finding the skills that are the most common since it will create a dictionary of all the distinct skills mentioned in the descriptions as a whole`

In [37]:
data.columns

Index(['company_name', 'location', 'job_title', 'job_description', 'rating',
       'employer_estimate', 'min_salary', 'max_salary', 'avg_salary', 'Size',
       'Founded', 'Type', 'Industry', 'Sector', 'Revenue', 'skills'],
      dtype='object')

## Age of company from founded column

In [53]:
data.isnull().sum()

company_name           0
location               0
job_title              0
job_description        0
rating                53
employer_estimate      0
min_salary             0
max_salary             0
avg_salary             0
Size                  51
Founded               51
Type                  51
Industry              51
Sector                51
Revenue               51
skills                 1
age                  106
dtype: int64

In [70]:
data.Founded.value_counts() # to see if any anomaly value this column contains

1963    75
--      55
1916    13
2023    12
1982    11
1850     9
1860     8
1835     8
2015     7
1999     7
1908     7
2007     7
1995     6
2009     6
1973     5
2016     5
1953     5
2017     5
1994     4
1915     4
2014     4
1989     4
2002     4
1837     3
1858     3
1880     3
1799     3
2019     2
1870     2
1997     2
2013     2
2011     2
1690     2
1947     2
2020     2
1988     2
1977     2
1985     2
1969     2
1938     2
1981     2
1925     2
2008     2
1987     2
1849     2
1926     1
1727     1
2022     1
1841     1
Name: Founded, dtype: int64

In [51]:
y = data.Founded.apply(lambda x : int(x) if not x == '--' and not isinstance(x,float) else x)
data['age'] = np.nan
for i in range(data.shape[0]):
    if not isinstance(y[i],float) and not isinstance(y[i],str):
        data['age'][i] = 2024 - y[i]

`treating null values` - to be treated in the analysis phase

In [54]:
data.isnull().sum()

company_name           0
location               0
job_title              0
job_description        0
rating                53
employer_estimate      0
min_salary             0
max_salary             0
avg_salary             0
Size                  51
Founded               51
Type                  51
Industry              51
Sector                51
Revenue               51
skills                 1
age                  106
dtype: int64

## Export the cleaned data

In [72]:
data.to_csv('data_cleaned.csv', index = False)

In [69]:
# df2 = pd.read_csv(r"E:\Download\glassdoor_jobs.csv")
# df2.duplicated().sum()
# df2.shape